---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordStructuralTypesParam
source: html/97975efe-d88d-de4f-2aca-15e1d69e9e13.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordStructuralTypesParam Property

"Structural Framing Type"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussFamilyTopChordStructuralTypesParam { get; }
```